Catalogs/ВерсииКонфигурации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВерсииКонфигурации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Изменения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ВерсииКонфигурацииПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВерсииКонфигурацииПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ВерсииКонфигурации/Ext/ManagerModule.bsl
Процедура ПроверитьВерсииКонфигурацииПользователей() Экспорт
	
	Если НЕ НужноВыводитьИсториюВерсий() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.ВерсииКонфигурации) 
		ИЛИ Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ВерсииКонфигурацииПользователей)
		 ИЛИ Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ВерсииКонфигурацииПользователей)Тогда
		 
		 Сообщить("Недостаточно прав для просмотра информации об обновлении");
		Возврат;		
		
	КонецЕсли;
	
	ПрочитатьМакетВерсий();
	
	ТекущаяВерсия = ПолучитьПоследнююВерсию();
	
	Если Не ЗначениеЗаполнено(ТекущаяВерсия) Тогда
		Возврат;
	КонецЕсли;	
	
	ТекущаяВерсияПользователя = ПолучитьПоследнююВерсиюПользователя();
	
	Если ТекущаяВерсия = ТекущаяВерсияПользователя Тогда
		Возврат;
	КонецЕсли;
		
	ПоказатьИсториюВерсий(ТекущаяВерсияПользователя);
	
КонецПроцедуры

Процедура ПрочитатьМакетВерсий()
	
	Макет = Справочники.ВерсииКонфигурации.ПолучитьМакет("ОписаниеОбновленийВерсии");
	
	Версия = Неопределено;
	
	Для Инд = 1 По Макет.ВысотаТаблицы Цикл	
		
		Область = Макет.ПолучитьОбласть(Инд, 1);
		Текст = СокрЛП(Область.ТекущаяОбласть.Текст);
		
		Если Не ЗначениеЗаполнено(Текст) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Лев(Текст, 2) = "UT" Тогда
			Версия = СоздатьОбновитьВерсию(Текст);			
			Продолжить;
		КонецЕсли;     
		
		Если ЗначениеЗаполнено(Версия) Тогда
			
			ВерсияОбъект = Версия.ПолучитьОбъект();
			
			НоваяСтрока = ВерсияОбъект.Изменения.Добавить();
			НоваяСтрока.Наименование = Текст;				
			
			ВерсияОбъект.Записать();
			
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьОбновитьВерсию(НомерВерсии)
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВерсииКонфигурации.Ссылка КАК Версия
		|ИЗ
		|	Справочник.ВерсииКонфигурации КАК ВерсииКонфигурации
		|ГДЕ
		|	ВерсииКонфигурации.Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Наименование", НомерВерсии);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда		
			
			ВерсияОбъект = Выборка.Версия.ПолучитьОбъект();
			ВерсияОбъект.Изменения.Очистить();
			ВерсияОбъект.Записать();  		
			Возврат Выборка.Версия;
			
		Иначе
			
			НоваяВерсия = Справочники.ВерсииКонфигурации.СоздатьЭлемент();
			НоваяВерсия.Наименование = НомерВерсии;
			НоваяВерсия.Записать();
			Возврат НоваяВерсия.Ссылка;
			
		КонецЕсли;   
		
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

Процедура ПоказатьИсториюВерсий(ТекущаяВерсияПользователя = Неопределено)
	
	Запрос = Новый Запрос;      
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВерсииКонфигурации.Ссылка КАК Версия,
	|	ВерсииКонфигурации.Код КАК Код
	|ИЗ
	|	Справочник.ВерсииКонфигурации КАК ВерсииКонфигурации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВерсииКонфигурацииПользователей.Версия,
	|	ВерсииКонфигурацииПользователей.Версия.Код
	|ИЗ
	|	РегистрСведений.ВерсииКонфигурацииПользователей КАК ВерсииКонфигурацииПользователей
	|ГДЕ
	|	ВерсииКонфигурацииПользователей.Пользователь = &Пользователь
	|	И НЕ ВерсииКонфигурацииПользователей.Версия = ЗНАЧЕНИЕ(Справочник.ВерсииКонфигурации.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код УБЫВ";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	ТаблицаВерсий = Запрос.Выполнить().Выгрузить();
	ТаблицаВерсий.Свернуть("Версия");
	
	МассивВерсийДляПоказа = Новый Массив();
	
	Для каждого СтрокаТабл Из ТаблицаВерсий Цикл
		
		Версия = СтрокаТабл.Версия;
		
		Если Не ЗначениеЗаполнено(Версия) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяВерсияПользователя) И Версия = ТекущаяВерсияПользователя Тогда
			Прервать;
		КонецЕсли;     	
				
		МассивВерсийДляПоказа.Добавить(Версия);	
		
	КонецЦикла;	
	
	Если МассивВерсийДляПоказа.Количество() > 0 Тогда
		
		ВывестиИсториюВерсийВТабДокумент(МассивВерсийДляПоказа);
		
		МенеджерЗаписи = РегистрыСведений.ВерсииКонфигурацииПользователей.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.Версия = МассивВерсийДляПоказа[0];
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиИсториюВерсийВТабДокумент(МассивВерсийДляПоказа)
	
	Макет = ПолучитьМакет("ОписаниеОбновлений");
	ТабДокумент = Новый ТабличныйДокумент;
	
	ОбластьОтступ = Макет.ПолучитьОбласть("Отступ");
	ОбластьВерсия = Макет.ПолучитьОбласть("Версия");
	ОбластьИзменение = Макет.ПолучитьОбласть("Изменение");
	
	ТабДокумент.Вывести(ОбластьОтступ);
	
	Для каждого Версия Из МассивВерсийДляПоказа Цикл
		
		ОбластьВерсия.Параметры.Версия = Версия.Наименование;
		ТабДокумент.Вывести(ОбластьВерсия);
		
		Для каждого Изменение Из Версия.Изменения Цикл
			
			ОбластьИзменение.Параметры.Наименование = Изменение.Наименование;
			ТабДокумент.Вывести(ОбластьИзменение);			
			
		КонецЦикла;
		
		ТабДокумент.Вывести(ОбластьОтступ);
		
	КонецЦикла;
	
	ФормаВывода = ПолучитьФорму("ОбщаяФорма.ВерсииКонфигурации");
	ФормаВывода.ПечатныйДокумент = ТабДокумент;
	ФормаВывода.Открыть();
	
КонецПроцедуры

Функция ПолучитьПоследнююВерсию()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВерсииКонфигурации.Ссылка КАК Версия
	|ИЗ
	|	Справочник.ВерсииКонфигурации КАК ВерсииКонфигурации
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Версия;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ПолучитьПоследнююВерсиюПользователя()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВерсииКонфигурацииПользователей.Версия
	               |ИЗ
	               |	РегистрСведений.ВерсииКонфигурацииПользователей КАК ВерсииКонфигурацииПользователей
	               |ГДЕ
	               |	ВерсииКонфигурацииПользователей.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Версия;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция НужноВыводитьИсториюВерсий() Экспорт
	
	Возврат НЕ УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "НеПоказыватьИсториюВерсий");
	
КонецФункции
